## [Replacing values](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html#replacing-values)

In [9]:
import pandas as pd
import numpy as np

In [10]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [11]:
df = pd.DataFrame(np.eye(3))
df

     0    1    2
0  1.0  0.0  0.0
1  0.0  1.0  0.0
2  0.0  0.0  1.0

In [12]:
df_missing = df.replace(0, np.nan)
df_missing

     0    1    2
0  1.0  NaN  NaN
1  NaN  1.0  NaN
2  NaN  NaN  1.0

In [13]:
df_filled = df_missing.replace(np.nan, 2)
df_filled

     0    1    2
0  1.0  2.0  2.0
1  2.0  1.0  2.0
2  2.0  2.0  1.0

Replacing more than one value is possible by passing a list.

In [20]:
df_filled.replace([1,2], [44,28])

      0     1     2
0  44.0  28.0  28.0
1  28.0  44.0  28.0
2  28.0  28.0  44.0

In [19]:
df_filled.replace({1 : 44, 2 : 28})

      0     1     2
0  44.0  28.0  28.0
1  28.0  44.0  28.0
2  28.0  28.0  44.0